branches/smartstep_under_construction/src_test/extensions-testbed/results/smartSTEP(20100717)/cipher-throw-wsinterceptorexception-cout/soap-trace-client.log

Tracing Web Service client: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Inbound SOAP message containing a Fault:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <S:Fault>
      <faultcode>S:Client</faultcode>
      <faultstring>step.framework.extensions.InterceptorException: Can't decipher a plain text message.</faultstring>
    </S:Fault>
  </S:Body>
</S:Envelope>
